Tekla Open API Reference for Tekla Structures 2025
AnalysisBar.Composite Property
 Gets or sets the composite beam of the analysis bar.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisCompositeBeam Composite { get; set; }
Public Property Composite As AnalysisCompositeBeam
	Get
	Set
Property Value
Type: AnalysisCompositeBeam
See Also
Reference
AnalysisBar Class
Tekla.Structures.Analysis Namespace